Дошкольное_учреждение83/src/Catalogs/ВходящиеДокументы/ВходящиеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВходящиеДокументы</name>
  <basedOn>Catalog.ИсходящиеДокументы</basedOn>
  <attributes>
    <name>АвторРезолюции</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВходящихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВОтветНа</name>
    <type>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРезолюции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дело</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленОтвет</name>
    <type>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписал</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение адресата</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметПереписки</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Резолюция</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолучения</name>
    <type>
      <types>CatalogRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>удуДержательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>удуРебенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/ИсходящиеДокументы/ИсходящиеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсходящиеДокументы</name>
  <basedOn>Catalog.ВходящиеДокументы</basedOn>
  <attributes>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВОтветНа</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дело</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение подписавшего</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.СпискиРассылкиПоКорреспондентам</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученОтвет</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметПереписки</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтправки</name>
    <type>
      <types>CatalogRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Ожидаемый срок ответа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>удуДержательДокумента</name>
    <type>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>удуРебенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/ВнутренниеДокументы/ВнутренниеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнутренниеДокументы</name>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дело</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение подготовившего</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>удуДержательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>удуРебенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>удуДети</name>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/CommonForms/ВключениеИспользованияВидовДокументов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипДокумента = Параметры.ТипДокумента;
	Если ТипДокумента = "ВходящийДокумент" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВходящиеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВходящиеДокументы КАК ВходящиеДокументы
		|ГДЕ
		|	ВходящиеДокументы.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыВходящихДокументов.ПустаяСсылка)";
		
		Элементы.Декорация.Заголовок = 
			НСТР("ru = 'Выполняется включение использования видов входящих документов.'") + Символы.ПС + 
			НСТР("ru = 'Укажите вид документа для заполнения существующих документов с незаполненным видом.'");
			
		ВидДокумента = Справочники.ВидыВходящихДокументов.ПустаяСсылка();
			
	ИначеЕсли ТипДокумента = "ИсходящийДокумент" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ИсходящиеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИсходящиеДокументы КАК ИсходящиеДокументы
		|ГДЕ
		|	ИсходящиеДокументы.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыИсходящихДокументов.ПустаяСсылка)";
		
		Элементы.Декорация.Заголовок = 
			НСТР("ru = 'Выполняется включение использования видов исходящих документов.'") + Символы.ПС + 
			НСТР("ru = 'Укажите вид документа для заполнения существующих документов с незаполненным видом.'");
			
		ВидДокумента = Справочники.ВидыИсходящихДокументов.ПустаяСсылка();
			
	ИначеЕсли ТипДокумента = "ВнутреннийДокумент" Тогда	
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВнутренниеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
		|ГДЕ
		|	ВнутренниеДокументы.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыВнутреннихДокументов.ПустаяСсылка)";
		
		Элементы.Декорация.Заголовок = 
			НСТР("ru = 'Выполняется включение использования видов внутренних документов.'") + Символы.ПС + 
			НСТР("ru = 'Укажите вид документа для заполнения существующих документов с незаполненным видом.'");
			
		ВидДокумента = Справочники.ВидыВнутреннихДокументов.ПустаяСсылка();
		
	КонецЕсли;	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(), "СписокДокументов");
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда 
		Предупреждение(НСтр("ru= 'Не указан ""Вид документа""'"));
		Возврат;
	КонецЕсли;	
	
	ЗаполнитьДокументы();
	Закрыть(КодВозвратаДиалога.ОК);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументы()
	
	НачатьТранзакцию();
	Попытка 
		Для Каждого Строка Из СписокДокументов Цикл
			ДокументОбъект = Строка.Ссылка.ПолучитьОбъект();
			ДокументОбъект.ВидДокумента = ВидДокумента;
			ДокументОбъект.Записать();
		КонецЦикла;	
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры
